<a href="https://akademie.datamics.com/kursliste/">![title](bg_datamics_top.png)</a>

<center><em>© Datamics</em></center><br><center><em>Besuche uns für mehr Informationen auf <a href='https://akademie.datamics.com/kursliste/'>www.akademie.datamics.com</a></em></center>
# Daten Input und Output

Dieses Notebook dient als Referenz, um Input und Output zu erhalten. Pandas kann eine Vielzahl von Dateitypen durch die Methode `pd.read_` lesen. Lasst uns die häufigsten Daten Typen anschauen:

In [7]:
import numpy as np
import pandas as pd

## CSV
### CSV Input

In [8]:
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### CSV Output

In [9]:
df.to_csv('my_example.csv',index=False)

## Excel

Pandas kann Excel-Dateien lesen und schreiben. Beachtet aber, dass dabei nur Daten importiert werden. Formeln und Bilder sind dabei nicht eingeschlossen. Makros oder Bilder in der Datei zu haben kann die `read_excel` Methode zum Abstürzen bringen.

### Excel Input

In [10]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

### Excel Output

In [11]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

## HTML

Es ist gut möglich, dass du zuerst die html5lib, lxml und BeautifulSoup4 installieren müsst. In deinem Terminal bzw. deiner Kommandozeile führe folgenden Code aus:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4
    
Dann starte das Jupyter Notebook neu.

Pandas kann Tabellen Tabs aus einem HTMl lesen. Zum Beispiel:

### HTML Input

Pandas `read_html` Methode wird Tabellen aus dem HTML auslesen und eine Liste von Data Frames zurückgeben:

In [12]:
df_html = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [13]:
df_html[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","August 12, 2019"
3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
...,...,...,...,...,...,...,...
551,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
552,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
553,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
554,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
555,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

## SQL (optional)

In [14]:
from sqlalchemy import create_engine

In [15]:
engine = create_engine('sqlite:///:memory:')

In [16]:
df.to_sql('data', engine)

In [17]:
sql_df = pd.read_sql('data',con=engine)

In [18]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

## JSON

In [19]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [20]:
# Heres an example of what a JSON (JavaScript Object Notation) looks like:
json_obj = """
{   "zoo_animal": "Lion",
    "food": ["Meat", "Veggies", "Honey"],
    "fur": "Golden",
    "clothes": null, 
    "diet": [{"zoo_animal": "Gazelle", "food":"grass", "fur": "Brown"}]
}
"""

In [21]:
#Let import json module
import json

#Lets load json data
data = json.loads(json_obj)

#Show
data

#WE can also convert back to JSON
json.dumps(data)

#We can simply open JSON data after loading with a DataFrame
dframe = DataFrame(data['diet'])

#Show
dframe

# Theres lost of custom selection you can do, based on what you do or dont want in your DataFrame (you can specify columns..etc)

  zoo_animal   food    fur
0    Gazelle  grass  Brown

# Gut gemacht!